app/views/topics/edit.html.erb

<% if session["user_id"].present?%>
    <%if User.find_by(id: session["user_id"]).username == @topic.user%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]