app/views/topics/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "connectors" ON "tags"."id" = "connectors"."tag_id" WHERE "connectors"."topic_id" = ?  [["topic_id", 2]]
---
<h2><%= @topic.title %></h2>
<% @topic.tags.each do |t| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <% if session["user_id"].present?%>
            <%if User.find_by(id: session["user_id"]).username == @topic.user%>

SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = 4  ORDER BY id content
---

    <% Comment.where(topic_id: @topic.id).each do |comment| %>