app/views/subforums/new.html.erb

<% if session[:user_id].present? %>
    <%if User.find_by(id: session["user_id"]).username == "Admin"%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]