app/views/subforums/show.html.erb

    <% if session["user_id"].present?%>
        <%if User.find_by(id: session["user_id"]).username == "Admin"%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]


<% Topic.where(subforum_id: @subforum.id).each do |topic| %>
---
SELECT "topics".* FROM "topics" WHERE "topics"."subforum_id" = 1