app/views/tags/show.html.erb

SELECT "topics".* FROM "topics" INNER JOIN "connectors" ON "topics"."id" = "connectors"."topic_id" WHERE "connectors"."tag_id" = ?  [["tag_id", 5]]
---

    <% @tag.topics.each do |t| %>