app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("topic_id", "user", "post_number", "content") VALUES (?, ?, ?, ?)  [["topic_id", 1], ["user", "434"], ["post_number", 0], ["content", "43342"]]
---
  def create
    com=Comment.new
    com.topic_id = params["topic_id"]
    com.user=User.find_by(id: session["user_id"]).username
    com.post_number=params["id"].to_i
    com.content=params["content"]
    com.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "comments" SET "content" = ? WHERE "comments"."id" = ?  [["content", "dasfdsfs"], ["id", 2]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update content: params[:content]