app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" LIMIT 1000
---
  def index
    @tags = Tag.all.limit(1000)

INSERT INTO "tags" ("title") VALUES (?)  [["title", "dasasd"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."title" = ? LIMIT 1  [["title", "wao"]]
SELECT  1 AS one FROM "connectors" WHERE "connectors"."topic_id" = ? AND "connectors"."tag_id" = ? LIMIT 1  [["topic_id", 1], ["tag_id", 1]]
SELECT  1 AS one FROM "tags" WHERE "tags"."title" = 'wao' LIMIT 1
INSERT INTO "connectors" ("topic_id", "tag_id") VALUES (?, ?)  [["topic_id", 1], ["tag_id", 1]]
---
  def create
    Tag.create title: params[:title] #will only happen if doesnt exist already
    @tag = Tag.find_by(title: params[:title])

    con=Connector.new
    con.topic_id = params["topic_id"]
    con.tag_id = @tag.id
    if !Connector.exists?(topic_id: params["topic_id"], tag_id: @tag.id)
      con.save #only save if it doesnt exist already, otherwise just use it for redirect