app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" LIMIT 1000
---
  def index
    @topics = Topic.all.limit(1000)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "topics" ("subforum_id", "content", "title", "user") VALUES (?, ?, ?, ?)  [["subforum_id", 1], ["content", "adsdasadsads"], ["title", "dsasaddas"], ["user", "Admin"]]
---
  def create
    top=Topic.new
    top.subforum_id = params["subforum_id"]
    top.content=params["content"]
    top.title=params["title"]
    top.user=User.find_by(id: session["user_id"]).username
    top.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "topics" SET "title" = ?, "subforum_id" = ?, "content" = ? WHERE "topics"."id" = ?  [["title", "cxxczcx"], ["subforum_id", nil], ["content", "cxxccx"], ["id", 8]]
---
  def update
    @topic = Topic.find(params[:id])
    @topic.update title: params[:title],
        content: params[:content]

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic= Topic.find(params[:id])
    Topic.delete(params[:id])