app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest") VALUES (?, ?)  [["username", "mike"], ["password_digest", "$2a$10$LjvPmaRvDg7QyCLdnmEL8ulaq8m9yhHLKsG3vY8CFLBfUAlRb937i"]]
---
  def create
    @user=User.new(username: params[:username], password: params[:password])
    if @user.save